app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["body", "test\r\n"], ["user_id", 1], ["created_at", "2021-07-24 11:58:33.332509"], ["updated_at", "2021-07-24 11:58:33.332509"]]

  def edit
    @book = Book.new
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]